app/controllers/access_controller.rb

   def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "description", "location", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def attempt_login

    if params[:username].present? && params[:password].present?
      found_user = User.where(username: params[:username]).first
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'm'  ORDER BY "users"."id" ASC LIMIT 1